# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'git'
brew 'ffmpeg'
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'speedtest-cli'
brew 'mackup'

# Development
brew 'python'
brew 'mysql'

# Apps
cask 'google-chrome'
cask 'discord'
cask 'spotify'
cask 'docker'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'
cask 'warp'

# Fonts
cask 'font-fira-code'